[
  {
    "id": "1",
    "slug": "e-commerce-website",
    "title": "Coffee Shop and Plantation E-Commerce Website",
    "short": "Sarponesia is a web-based platform that digitalizes coffee business management for efficient, secure, and integrated operations.",
    "long": "Sarponesia project is designed as a web-based information system aimed at supporting the management and digitalization of Indonesia’s coffee business processes. The main goal of this project is to provide an integrated platform for administrators to manage products, services, articles, orders, and partnerships, while delivering an efficient user experience in purchasing and product reviewing. With structured management features such as product pages, service listings, articles, order processing, checkout, and reviews, the system seeks to enhance administrative efficiency, expand marketing reach, and foster direct interaction between service providers and customers. Overall, Sarponesia is developed to support the digital transformation of coffee-related MSMEs through a user-friendly, secure, and integrated approach.",
    "tech": ["React", "Node.js", "Express", "MongoDB", "Stripe", "Tailwind CSS"],
    "image": "/images/projects/ecommerce-preview.jpg",
    "repo": "https://github.com/MuliaSimanjuntak-2/ecommerce-website",
    "live": "https://ecommerce-demo.vercel.app",
    "date": "2024-03-15",
    "role": "Project Manager",
    "challenges": [
      "Implementing secure payment processing with Stripe",
      "Optimizing database queries for product search",
      "Creating responsive design for mobile shopping experience"
    ],
    "solutions": [
      "Used Stripe's secure payment APIs with webhook validation",
      "Implemented MongoDB indexing and aggregation pipelines",
      "Applied mobile-first design principles with Tailwind CSS"
    ],
    "hasDetailPage": true
  },
  {
    "id": "2",
    "slug": "automated-penetration-system",
    "title": "Automated Penetration System",
    "short": "A comprehensive automated penetration testing platform with real-time vulnerability scanning and detailed security reporting.",
    "long": "An advanced automated penetration testing system built with React and Node.js, designed for cybersecurity professionals. Features include automated vulnerability scanning, real-time threat detection, comprehensive security reporting, and integration with popular security frameworks. The system provides detailed penetration test reports, vulnerability assessments, and security recommendations with an intuitive dashboard for monitoring security posture.",
    "tech": ["React", "Node.js", "Python", "Nmap", "Metasploit", "PostgreSQL", "Docker"],
    "image": "/images/projects/penetration-system-preview.jpg",
    "repo": "https://github.com/MuliaSimanjuntak-2/automated-penetration-system",
    "live": "https://penetration-system-demo.vercel.app",
    "date": "2024-02-20",
    "role": "Project Manager & Frontend Developer",
    "metrics": {
      "scans": "500+ automated scans completed",
      "vulnerabilities": "1000+ vulnerabilities detected",
      "accuracy": "95% detection accuracy"
    },
    "challenges": [
      "Integrating multiple security tools and frameworks",
      "Creating intuitive interface for complex security data",
      "Ensuring system security while performing penetration tests"
    ],
    "solutions": [
      "Developed unified API layer for seamless tool integration",
      "Implemented progressive data visualization with interactive charts",
      "Applied containerization and secure coding practices throughout"
    ],
    "hasDetailPage": true
  },
  {
    "id": "3",
    "slug": "ticket-booking-app",
    "title": "Ticket Booking Application",
    "short": "A comprehensive Android ticket booking application built with Kotlin for movies, events, and transportation.",
    "long": "A native Android application developed using Kotlin that provides a seamless ticket booking experience for movies, concerts, events, and transportation. The app features user authentication, seat selection with interactive UI, secure payment integration, QR code ticket generation, and real-time booking status. Built with modern Android architecture components including MVVM pattern, Room database, and Retrofit for API communication. The application supports offline ticket storage and push notifications for booking confirmations and reminders.",
    "tech": ["Kotlin", "Android SDK", "Room Database", "Retrofit", "Firebase", "Material Design", "MVVM Architecture"],
    "image": "/images/projects/ticket-booking-preview.jpg",
    "repo": "https://github.com/MuliaSimanjuntak-2/UAS_KonserTicketApp.git",
    "live": "https://play.google.com/store/apps/details?id=com.mulia.ticketbooking",
    "date": "2024-01-10",
    "role": "Android Developer",
    "metrics": {
      "downloads": "10K+ app downloads",
      "rating": "4.8/5 user rating",
      "bookings": "5000+ successful bookings"
    },
    "challenges": [
      "Implementing real-time seat selection with multiple users",
      "Integrating secure payment gateways for mobile platform",
      "Creating responsive UI for various Android screen sizes",
      "Managing offline ticket storage and synchronization"
    ],
    "solutions": [
      "Used Firebase Realtime Database for concurrent seat booking",
      "Integrated multiple payment providers with secure tokenization",
      "Implemented responsive layouts with ConstraintLayout and Material Design",
      "Built robust offline-first architecture with Room and WorkManager"
    ],
    "hasDetailPage": true
  }
]